# SLU1 - Pandas 101: Examples notebook

In [1]:
import pandas as pd

### Create a pandas Series with some countries, capital and population

In [2]:
countries = pd.Series(['Denmark', 'Finland', 'Iceland', 'Norway', 'Greenland', 'Faroe Islands'])
capitals = pd.Series(['Copenhagen', 'Helsinki', 'Reykjavík', 'Oslo', 'Nuuk', 'Tórshavn'])
pop = pd.Series([5724456, 5498211, 335878, 5265158,56483,49188])

### Creating a pandas DataFrame

In [3]:
nordic_countries = pd.DataFrame({'Country': countries, 'Capital': capitals, 'Population':pop})

In [4]:
nordic_countries

      Capital        Country  Population
0  Copenhagen        Denmark     5724456
1    Helsinki        Finland     5498211
2   Reykjavík        Iceland      335878
3        Oslo         Norway     5265158
4        Nuuk      Greenland       56483
5    Tórshavn  Faroe Islands       49188

### Adding a new column

In [5]:
gdp = [306.7 ,  236.8 ,  20.0, 370.4, 2.22 , 2.77]

In [6]:
nordic_countries['gdp'] = gdp

In [7]:
nordic_countries

      Capital        Country  Population     gdp
0  Copenhagen        Denmark     5724456  306.70
1    Helsinki        Finland     5498211  236.80
2   Reykjavík        Iceland      335878   20.00
3        Oslo         Norway     5265158  370.40
4        Nuuk      Greenland       56483    2.22
5    Tórshavn  Faroe Islands       49188    2.77

### Load a file

`pd.read_csv(filepath)`

This filepath is specific to the file you want and depends on where you currently are

In [8]:
iris = pd.read_csv('data/iris.csv')

### Info about the DataFrame

In [9]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

### Printing the top 10 entries

In [10]:
iris.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

### Printing the bottom 10 entries

In [11]:
iris.tail(10)

     sepal_length  sepal_width  petal_length  petal_width    species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

### Shape of the DataFrame

In [12]:
iris.shape

(150, 5)

In [13]:
nr_rows = iris.shape[0]
nr_cols = iris.shape[1]

### Get more information about the numerical features

In [14]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000